# Тестовый набор данных. Игрок называет Москву, CPU проигрывает

cities_list = [
    [],  # а
    [],  # б
    [],  # в
    [],  # г
    [],  # д
    [],  # е
    [],  # ж
    [],  # з
    [],  # и
    [],  # й
    [],  # к
    [],  # л
    ['москва'],  # м
    [],  # н
    [],  # о
    [],  # п
    [],  # р
    [],  # с
    [],  # т
    [],  # у
    [],  # ф
    [],  # х
    [],  # ц
    [],  # ч
    [],  # ш
    [],  # щ
    [],  # ъ
    [],  # ы
    [],  # ь
    [],  # э
    [],  # ю
    []   # я
]
