[
  {
    "name": "Кроссовки Response CL adidas логотип белые спортивные",
    "price": "5999",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/612/ad5585f855c85b7d86efd3dd8d548074.jpeg",
    "description": "Цвет Белый  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамГотовы ко всему. Кроссовки adidas Response CL в стиле моделей для трейлраннинга. Мягкая и легкая промежуточная подошва дарит комфорт и на прогулках, и на шашлыках, и на танцплощадке. Серьёзно, кто сказал, что выезд на природу  это сложно?"
  },
  {
    "name": "Кроссовки Lite Racer 2.0 adidas логотип белые спортивные",
    "price": "1699",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/320/020125a9d07e6c9855b293d700759189.jpeg",
    "description": "Цвет Белый  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамУниверсальные кроссовки в спортивном стиле для активного образа жизни. Дышащий сетчатый верх обеспечивает ощущение комфорта, а амортизирующая промежуточная подошва смягчает каждый шаг. Бесшовные три полоски подчеркивают аутентичный стиль adidas."
  },
  {
    "name": "Кроссовки adidas Yeezy Boost 350 V2 Black (Non-Reflective) FU9006 логотип черные деним",
    "price": "1799",
    "link": "https://kasta.ua/image/345/uploads/product_image/2021/11/522/24246a814b0d5dc1263d6b977b2fd766.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Всесезон  Принадлежность МужчинамМировой бренд с тремя полосами из Херцогенаураха каким мы его теперь знаем, существует уже почти 70 лет. Развитие собственного ассортимента продукции и обеспечение максимальной производительности всегда были главной мотивацией для дизайнеров. Сегодня Adidas может опираться на уникальную историю своей продукции."
  },
  {
    "name": "Кроссовки OZWEEGO adidas логотип черные спортивные",
    "price": "5399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/646/0151f99ec1c0626585c88b1ffe2f9331.jpeg",
    "description": "Цвет Черный  Состав верха Натуральная кожа  Сезонность Демисезон  Принадлежность МужчинамНа что может быть похожа прогулка по облакам? Возможно, на что-то вроде этих adidas OZWEEGO. В основе этой пары лежит беговая модель 90-х, дополненная технологией амортизации Adiprene. Поэтому каждый шаг в них ощущается так же хорошо, как выглядит."
  },
  {
    "name": "Кроссовки Lite Racer 2.0 adidas логотип черные спортивные",
    "price": "1699",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/357/5936492817865804b41a92c71adf7da5.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамУниверсальные кроссовки в спортивном стиле для активного образа жизни. Дышащий сетчатый верх обеспечивает ощущение комфорта, а амортизирующая промежуточная подошва смягчает каждый шаг. Бесшовные три полоски подчеркивают аутентичный стиль adidas."
  },
  {
    "name": "Кроссовки adidas абстрактные комбинированные спортивные",
    "price": "1925",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/07/336/9f9d43d8a3b48b67fc6a95fa388477c4.jpeg",
    "description": "Цвет Комбинированный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамЛегкие комфортные кроссовки на шуровке, высота подошвы 2 см. "
  },
  {
    "name": "КРОСІВКИ Originals Yung-1 adidas Adidas Originals Yung-1 однотонные черные спортивные",
    "price": "3050",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/24/814164576568546ead22889bcd4359c0.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль, Натуральная замша  Сезонность Демисезон  Принадлежность МужчинамКРОСІВКИ Adidas Originals Yung-1 G27026 Черный"
  },
  {
    "name": "Кроссовки adidas хаки кэжуал",
    "price": "3372",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/07/35/50e3ee80d84a0b28b740fe51038cbc6e.jpeg",
    "description": "Цвет Хаки  Сезонность Демисезон  Принадлежность МужчинамКроссовки мужские Adidas Ozelia (GX6449)"
  },
  {
    "name": "Кроссовки BREAKNET adidas логотип белые спортивные",
    "price": "1799",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/443/e93ec1ac303c17a494d5d35e3a508274.jpeg",
    "description": "Цвет Белый  Состав верха Текстиль  Сезонность Демисезон  Принадлежность Мужчинам"
  },
  {
    "name": "Мужские кроссовки adidas RUNFALCON 2.0 логотип черные спортивные",
    "price": "2090",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/01/525/c3bbe50b13ae596081ce4e7a08043f11.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамМужские кроссовки Adidas RUNFALCON 2.0 TR FZ3578 легкая модель, дополненная эластичным верхом и крепкой подошвой. Особенности: • Верх из синтетики и дышащего текстиля • На шнурках для надежной фиксации стопы • Внутри мягкая стелька и подкладка из текстиля. • Резиновые вставки adidas ADIWEAR чрезвычайно прочны и установлены в тех местах подошвы, где наиболее высок риск стирания. • Легкая промежуточная подошва EVA • Резиновая подошва для лучшего сцепления с поверхностью  "
  },
  {
    "name": "Мужские кроссовки adidas Racer Tr21 логотип черные спортивные",
    "price": "2390",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/03/629/901997910ea0a0ab9e720e4b20803c34.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамВ этой обуви вы будете чувствовать себя комфортно и легко на каждом шагу дня. Легкая амортизация, вдохновленная бегом. Дизайн с 3 полосками придает классический стиль Adidas любому образу. Этот продукт изготовлен из Primegreen, серии переработанных материалов с высокими эксплуатационными характеристиками. 50% верха - это переработанное содержимое."
  },
  {
    "name": "Кроссовки Ozweego adidas Adidas Ozweego логотип серые спортивные",
    "price": "3123",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/313/4a256fbd769c6c785fff3c73c8d970cc.jpeg",
    "description": "Цвет Серый  Состав верха Натуральная кожа, Текстиль  Сезонность Всесезон  Принадлежность МужчинамКроссовки Adidas Ozweego FX6058 Серый"
  },
  {
    "name": "Кроссовки Lite Racer 2.0 adidas логотип черные спортивные",
    "price": "1699",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/457/af496f85b497f7135820ece9777083a4.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамУниверсальные кроссовки в спортивном стиле для активного образа жизни. Дышащий сетчатый верх обеспечивает ощущение комфорта, а амортизирующая промежуточная подошва смягчает каждый шаг. Бесшовные три полоски подчеркивают аутентичный стиль adidas."
  },
  {
    "name": "Кроссовки Ozelia adidas логотип черные спортивные",
    "price": "4399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/313/117c6db78cadbed641e36b7a5deb35e8.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамВозможно, ты далек от 90-х, но Ozelia пришли именно из той эпохи ярких экспериментов. Вдохновленные архивными моделями adidas, эти массивные кроссовки созданы привлекать внимание. Динамичный дизайн и подошва с мягкой, комфортной амортизацией Adiprene как нельзя лучше подходят для активных дней.Модель выполнена из переработанных материалов в рамках наших обязательств по сокращению пластиковых отходов. 20% элементов верха минимум на 50% состоят из переработанных материалов."
  },
  {
    "name": "Кроссовки OZWEEGO Celox adidas логотип бежевые спортивные",
    "price": "4999",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/319/73e41dea608379605d06a7be6d3f3d9e.jpeg",
    "description": "Цвет Бежевый  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамКроссовки adidas OZWEEGO Celox сами по себе не определяют будущее. А вот то, чем ты будешь в них заниматься и куда пойдешь, может повлиять на многое. Текстильный верх этой модели с прорезями и сетчатой подкладкой обеспечивает вентиляцию и комфорт, пока ты бегаешь по делам. Рельефная промежуточная подошва из ЭВА с амортизацией Adiprene и Adiprene+ приятно ощущается с утра и до самого позднего вечера."
  },
  {
    "name": "Баскетбольные кроссовки Pro Model 2G adidas логотип черные спортивные",
    "price": "3799",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/40/e08a7755f8d1641b75414387dbe4e392.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамБаскетбольная классика, обновленная для современных площадок. Прочные кроссовки adidas с устойчивой пяткой. Ощущаются мягко и позволяют уверенно менять направление движения. Легкие и комфортные — в них удобно обходить защитников."
  },
  {
    "name": "Кроссовки Terrex Brushwood adidas логотип черные спортивные",
    "price": "3399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/330/e0b1c47ec12afc8f4924d8d7ce76ecf2.jpeg",
    "description": "Цвет Черный  Состав верха Натуральный нубук  Сезонность Демисезон  Принадлежность МужчинамДля пеших маршрутов и бега. Кроссовки с прочным поддерживающим верхом из синтетических материалов для трейла по пересеченной местности. Промежуточная подошва из ЭВА и амортизация в пятке дарят комфорт в течение всего дня. Ребристая резиновая подметка обеспечивает сцепление и уверенность на смешанном рельефе.Надежное сцеплениеПодошва Traxion для оптимального сцепления; резина Continental™ для максимального сцепления как с влажными, так и с сухими поверхностямиАмортизирующие вставкиАмортизирующая вставка Adiprene в пятке; легкая промежуточная подошва из ЭВА"
  },
  {
    "name": "Кроссовки adidas однотонные белые спортивные",
    "price": "1981",
    "link": "https://kasta.ua/image/345/uploads/product_image/2020/09/240/2ac25fb7f70f167dd7050362c9d0f36b.jpeg",
    "description": "Цвет Белый  Состав верха Искусственная кожа  Сезонность Всесезон  Принадлежность МужчинамВозвращай сложные подачи в этих легких теннисных кроссовках. Модель создана для спортсменов-любителей. Верх выполнен из прочного материала под кожу с сетчатой вставкой на пятке. Мягкая промежуточная подошва амортизирует и дарит комфорт, а резиновая подметка обеспечивает хорошее сцепление. Стандартная колодка."
  },
  {
    "name": "Кроссовки Continental 80 adidas логотип белые спортивные",
    "price": "3999",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/458/710206f19c83dda8e53937405d0bb7d3.jpeg",
    "description": "Цвет Белый  Состав верха Текстиль  Сезонность Всесезон  Принадлежность УнисексНостальгическая линейка Continental 80 повторяет ретро-силуэт спортивных кроссовок начала 80-х. Комфортный кожаный верх дополнен наклонной двухцветной полоской и фирменной разделенной подошвой из гибкой резины.Винтажные деталиЛоготип рядом с панелью шнуровки в стиле 80-хПривычный комфортПодкладка из мягкого махрового трикотажа дарит комфорт и подчеркивает винтажный образРазделенная подошва Разделенная подошва со вставками из ЭВА позволяет стопе двигаться естественно"
  },
  {
    "name": "Кроссовки для бега Ultraboost 21 adidas логотип черные спортивные",
    "price": "8399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/418/8e5de3184d5b949d5fdf8c97683d36e0.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамМножество прототипов, инноваций и испытаний. В поисках безупречного сочетания легкости, амортизации и упругости. Ultraboost 21 — это новый уровень возврата энергии."
  },
  {
    "name": "Баскетбольные кроссовки Dame 7 EXTPLY adidas логотип розовые спортивные",
    "price": "5399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/67/b7af2dbe0c26e2c951bf940b0862a0ac.jpeg",
    "description": "Цвет Розовый  Состав верха Текстиль  Сезонность Всесезон  Принадлежность УнисексКроссовки Dame 7 EXTPLY: DAME D.O.L.L.A. от adidas Basketball отдают дань уважения спортивным и музыкальным достижениям Дэмиана Лилларда. Дизайн верха вдохновлен шоу-бизнесом, а подошва дополнена амортизацией Lightstrike. Эксклюзивная модель представлена в том числе и в розовом цвете, который часто носит Дэйм. Можешь проверить в его резюме.Модель выполнена из переработанных материалов в рамках наших обязательств по сокращению пластиковых отходов. 20% элементов верха минимум на 50% состоят из переработанных материалов."
  },
  {
    "name": "Кроссовки Retropy E5 adidas логотип белые спортивные",
    "price": "5399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/653/b00009cb71822c4f98e174f5db94e772.jpeg",
    "description": "Цвет Белый  Состав верха Текстиль  Сезонность Демисезон  Принадлежность МужчинамТебя не ограничивают рамки, эпохи и чьи-то ожидания. Ты так же свободен, как эти кроссовки adidas. Они в равной степени олдскульные и новые. Дизайн модели позаимствован у беговых моделей 70-х и дополнен современной амортизацией Boost. Почувствуй под ногами спортивную энергию и наслаждайся винтажным стилем."
  },
  {
    "name": "Кроссовки мужские adidas IMMA BEA STAR черные спортивные",
    "price": "1999",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/06/359/578613af367529ebd1d2f7c657ac9cda.jpeg",
    "description": "Цвет Черный  Состав верха Текстиль, Искусственная замша  Сезонность Всесезон  Разновидность спорта Баскетбол  Принадлежность МужчинамAdidas (Адидас) – немецкий промышленный концерн, специализирующийся на выпуске спортивной обуви, одежды, сумок, часов, очков, инвентаря и других товаров, связанных со спортом. Компания является крупнейшим производителем спортивных товаров в Европе и вторым по величине в мире. Бренд adidas сегодня является одним из самых известных и продаваемых в мире спортивной экипировки. Сегодня он ассоциируется не только с обувью. Бренд пользуется большой любовью у молодежи и профессиональных спортсменов и имеет прочные позиции в футбольном мире."
  },
  {
    "name": "Кроссовки Supercourt adidas логотип белые спортивные",
    "price": "4399",
    "link": "https://kasta.ua/image/345/uploads/product_image/2022/02/418/f85785cf764dedb99ec4ebfa9eaf9c92.jpeg",
    "description": "Цвет Белый  Состав верха Натуральная кожа  Сезонность Всесезон  Принадлежность УнисексКроссовки Supercourt воплощают лучшие элементы теннисного стиля adidas. Эта версия с кожаным верхом дополнена перфорированными тремя полосками, декоративной прошивкой и накладками, которые создают эффектную текстуру."
  }
]